aaref5720/PIC18F4620-Drivers/MCAL_Layer/CCP/hal_ccp.h
/* 
 * File:   hal_ccp.h
 * Author: Abdelrahman Aref
 *
 * Created on April 30, 2024, 12:38 PM
 */

#ifndef HAL_CCP_H
#define	HAL_CCP_H

/* ----------------- Includes -----------------*/
#include "pic18f4620.h"
#include "../mcal_std_types.h"
#include "../../MCAL_Layer/GPIO/hal_gpio.h"
#include "../../MCAL_Layer/Interrupt/mcal_internal_interrupt.h"
#include "ccp_cfg.h"

/* ----------------- Macro Declarations -----------------*/
/* CCP1 Module Mode Select  */
#define CCP_MODULE_DISABLE                 ((uint8)0x00)
#define CCP_CAPTURE_MODE_1_FALLING_EDGE    ((uint8)0x04)
#define CCP_CAPTURE_MODE_1_RISING_EDGE     ((uint8)0x05)
#define CCP_CAPTURE_MODE_4_RISING_EDGE     ((uint8)0x06)
#define CCP_CAPTURE_MODE_16_RISING_EDGE    ((uint8)0x07)
#define CCP_COMPARE_MODE_SET_PIN_LOW       ((uint8)0x08)
#define CCP_COMPARE_MODE_SET_PIN_HIGH      ((uint8)0x09)
#define CCP_COMPARE_MODE_TOGGLE_ON_MATCH   ((uint8)0x02)
#define CCP_COMPARE_MODE_GEN_SW_INTERRUPT  ((uint8)0x0A)
#define CCP_COMPARE_MODE_GEN_EVENT         ((uint8)0x0B)
#define CCP_PWM_MODE                       ((uint8)0x0C)

/* CCP1 Capture Mode State  */
#define CCP1_CAPTURE_NOT_READY              0X00
#define CCP1_CAPTURE_READY                  0X01

/* CCP2 Capture Mode State  */
#define CCP2_CAPTURE_NOT_READY              0X00
#define CCP2_CAPTURE_READY                  0X01

/* CCP1 Compare Mode State  */
#define CCP1_COMPARE_NOT_READY              0X00
#define CCP1_COMPARE_READY                  0X01

/* CCP2 Compare Mode State  */
#define CCP2_COMPARE_NOT_READY              0X00
#define CCP2_COMPARE_READY                  0X01

/* Timer2 Input Clock Post-scaler */
#define CCP_TIMER2_POSTSCALER_DIV_BY_1       1
#define CCP_TIMER2_POSTSCALER_DIV_BY_2       2
#define CCP_TIMER2_POSTSCALER_DIV_BY_3       3
#define CCP_TIMER2_POSTSCALER_DIV_BY_4       4
#define CCP_TIMER2_POSTSCALER_DIV_BY_5       5
#define CCP_TIMER2_POSTSCALER_DIV_BY_6       6
#define CCP_TIMER2_POSTSCALER_DIV_BY_7       7
#define CCP_TIMER2_POSTSCALER_DIV_BY_8       8
#define CCP_TIMER2_POSTSCALER_DIV_BY_9       9
#define CCP_TIMER2_POSTSCALER_DIV_BY_10      10
#define CCP_TIMER2_POSTSCALER_DIV_BY_11      11
#define CCP_TIMER2_POSTSCALER_DIV_BY_12      12
#define CCP_TIMER2_POSTSCALER_DIV_BY_13      13
#define CCP_TIMER2_POSTSCALER_DIV_BY_14      14
#define CCP_TIMER2_POSTSCALER_DIV_BY_15      15
#define CCP_TIMER2_POSTSCALER_DIV_BY_16      16

/* Timer2 Input Clock Pre-scaler */
#define CCP_TIMER2_PRESCALER_DIV_BY_1        1
#define CCP_TIMER2_PRESCALER_DIV_BY_4        4
#define CCP_TIMER2_PRESCALER_DIV_BY_16       16



/* ----------------- Macro Functions Declarations -----------------*/

/* Set the CCP1 Mode Variant */
#define CCP1_SET_MODE(_CONFIG)  (CCP1CONbits.CCP1M = _CONFIG)
#define CCP2_SET_MODE(_CONFIG)  (CCP2CONbits.CCP2M = _CONFIG)

/* ----------------- Data Type Declarations -----------------*/

/*
  @Summary      Define the values to select the CCP1 Main mode
*/
typedef enum{
    CCP_CAPTURE_MODE_SELECTED = 0, /* Select CCP1 Capture Mode */
    CCP_COMPARE_MODE_SELECTED,     /* Select CCP1 Compare Mode */
    CCP_PWM_MODE_SELECTED          /* Select CCP1 PWM Mode */
}ccp1_mode_t;

/*
  @Summary      Defines the values to convert from 16bit to two 8 bit and vice versa
  @Description  Used to get two 8 bit values from 16bit also two 8 bit value are combine to get 16bit.
*/
typedef union{
    struct{
        uint8 ccpr_low;  /* CCPR1 low register */
        uint8 ccpr_high; /* CCPR1 high register */
    };
    struct{
        uint16 ccpr_16Bit; /* Read CCPR1 as a 16 Bit value */
    };
}CCP_REG_T;

typedef enum{
    CCP1_INST = 0,
    CCP2_INST
}ccp_inst_t;

typedef enum{
    CCP1_CCP2_TIMER3 = 0,
    CCP1_TIMER1_CCP2_TIMER3,
    CCP1_CCP2_TIMER1
}ccp_capture_timer_t;

typedef enum{
    RC1_PIN = 0,
    RB3_PIN
}ccp2_pin_select_t;

/*
  @Summary      CCP Module configurations
  @Description  This data type used to describe the module initialization configuration
*/
typedef struct{
    ccp_inst_t ccp_inst;
    ccp1_mode_t ccp_mode;           /* CCP main mode */
    uint8 ccp_mode_variant;         /* CCP selected mode variant */
    ccp2_pin_select_t ccp2_pin;     /* Configure only for CCP2  */
    ccp_capture_timer_t ccp_capture_timer;
#if (CCP1_CFG_SELECTED_MODE==CCP_CFG_PWM_MODE_SELECTED) || (CCP2_CFG_SELECTED_MODE==CCP_CFG_PWM_MODE_SELECTED)
    uint32 PWM_Frequency;      /* CCP PWM mode frequency */
    uint8 timer2_postscaler_value;
    uint8 timer2_prescaler_value;
#endif
#if CCP1_INTERRUPT_FEATURE_ENABLE==INTERRUPT_FEATURE_ENABLE
    void (* CCP1_InterruptHandler)(void);   /* Call back used for all CCP1 Modes */
    interrupt_priority_cfg CCP1_priority;   /* Configure the CCP1 mode interrupt */
#endif
#if CCP2_INTERRUPT_FEATURE_ENABLE==INTERRUPT_FEATURE_ENABLE
    void (* CCP2_InterruptHandler)(void);   /* Call back used for all CCP2 Modes */
    interrupt_priority_cfg CCP2_priority;   /* Configure the CCP1 mode interrupt */
#endif
}ccp_t;

/* ----------------- Software Interfaces Declarations -----------------*/

/**
 * @Summary Initializes the CCP module.
 * @Description This function initializes the CCP module according to the provided configuration.
 *              This function must be called before any other CCP module routines are called.
 *              It should only be called once during system initialization.
 * @Preconditions None
 * @param _ccp_obj Pointer to the CCP module configuration
 * @return Status of the function
 *          (E_OK) : The function executed successfully
 *          (E_NOT_OK) : The function encountered an issue while performing this action
 */
Std_ReturnType CCP_Init(const ccp_t *_ccp_obj);

/**
 * @Summary De-initializes the CCP module.
 * @Description This function de-initializes the CCP module.
 *              It should be called to release resources associated with the CCP module.
 * @Preconditions None
 * @param _ccp_obj Pointer to the CCP module configuration
 * @return Status of the function
 *          (E_OK) : The function executed successfully
 *          (E_NOT_OK) : The function encountered an issue while performing this action
 */
Std_ReturnType CCP_DeInit(const ccp_t *_ccp_obj);

#if (CCP1_CFG_SELECTED_MODE==CCP_CFG_CAPTURE_MODE_SELECTED) || (CCP2_CFG_SELECTED_MODE==CCP_CFG_CAPTURE_MODE_SELECTED)
/**
 * @Summary Checks if captured data is ready.
 * @Description This function checks if captured data is ready.
 * @Preconditions CCP module must be configured in capture mode.
 * @param _capture_status Pointer to store the capture status
 * @return Status of the function
 *          (E_OK) : Captured data is ready
 *          (E_NOT_OK) : Captured data is not ready
 */
Std_ReturnType CCP_IsCapturedDataReady(const ccp_t *_ccp_obj, uint8 *_capture_status);

/**
 * @Summary Reads the captured value in capture mode.
 * @Description This function reads the captured value in capture mode.
 * @Preconditions CCP module must be configured in capture mode.
 * @param capture_value Pointer to store the captured value
 * @return Status of the function
 *          (E_OK) : Successfully read the captured value
 *          (E_NOT_OK) : Failed to read the captured value
 */
Std_ReturnType CCP_Capture_Mode_Read_Value(const ccp_t *_ccp_obj, uint16 *capture_value);
#endif

#if (CCP1_CFG_SELECTED_MODE==CCP_CFG_COMPARE_MODE_SELECTED) || (CCP2_CFG_SELECTED_MODE==CCP_CFG_COMPARE_MODE_SELECTED)
/**
 * @Summary Checks if compare operation is complete.
 * @Description This function checks if the compare operation is complete.
 * @Preconditions CCP module must be configured in compare mode.
 * @param _compare_status Pointer to store the compare status
 * @return Status of the function
 *          (E_OK) : Compare operation is complete
 *          (E_NOT_OK) : Compare operation is not complete
 */
Std_ReturnType CCP_IsCompareComplete(const ccp_t *_ccp_obj, uint8 *_compare_status);

/**
 * @Summary Sets the compare value in compare mode.
 * @Description This function sets the compare value in compare mode.
 * @Preconditions CCP module must be configured in compare mode.
 * @param _ccp_obj Pointer to the CCP module configuration
 * @param compare_value The value to be set for comparison
 * @return Status of the function
 *          (E_OK) : Successfully set the compare value
 *          (E_NOT_OK) : Failed to set the compare value
 */
Std_ReturnType CCP_Compare_Mode_Set_Value(const ccp_t *_ccp_obj, uint16 compare_value);
#endif

#if (CCP1_CFG_SELECTED_MODE==CCP_CFG_PWM_MODE_SELECTED) || (CCP2_CFG_SELECTED_MODE==CCP_CFG_PWM_MODE_SELECTED)
/**
 * @Summary Sets the duty cycle for PWM output.
 * @Description This function sets the duty cycle for PWM output.
 * @Preconditions CCP module must be configured in PWM mode.
 * @param _ccp_obj Pointer to the CCP module configuration
 * @param _duty The duty cycle value (0-100)
 * @return Status of the function
 *          (E_OK) : Successfully set the duty cycle
 *          (E_NOT_OK) : Failed to set the duty cycle
 */
Std_ReturnType CCP_PWM_Set_Duty(const ccp_t *_ccp_obj, const uint8 _duty);

/**
 * @Summary Starts the PWM output.
 * @Description This function starts the PWM output.
 * @Preconditions CCP module must be configured in PWM mode.
 * @param _ccp_obj Pointer to the CCP module configuration
 * @return Status of the function
 *          (E_OK) : Successfully started PWM output
 *          (E_NOT_OK) : Failed to start PWM output
 */
Std_ReturnType CCP_PWM_Start(const ccp_t *_ccp_obj);

/**
 * @Summary Stops the PWM output.
 * @Description This function stops the PWM output.
 * @Preconditions CCP module must be configured in PWM mode.
 * @param _ccp_obj Pointer to the CCP module configuration
 * @return Status of the function
 *          (E_OK) : Successfully stopped PWM output
 *          (E_NOT_OK) : Failed to stop PWM output
 */
Std_ReturnType CCP_PWM_Stop(const ccp_t *_ccp_obj);
#endif


#endif	/* HAL_CCP_H */

